Documents/ЗапросСправкиСотрудником.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ЗапросСправкиСотрудником</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСправки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПредоставляемыхСотрудникамСправок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапросОбработан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Справка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗапросСправкиСотрудникомПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ЗапросСправкиСотрудником/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступом.ЗаполнитьНаборыЗначенийДоступа.
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	ЗарплатаКадрыРасширенный.ЗаполнитьНаборыПоФизическимЛицам(ЭтотОбъект, Таблица, "ФизическоеЛицо");
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТребуетсяСформироватьСправкуАвтоматически(РежимЗаписи) Тогда
		УстановитьПривилегированныйРежим(Истина);
		СоздатьСправку();
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)

	ЗапросОбработан = Ложь;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЗапросОбработан Тогда
		Если Не Пользователи.РолиДоступны(Метаданные.Роли.СогласованиеЗапросовСправокСотрудником.Имя) Тогда
			ТекстСообщения = НСтр("ru = 'Недостаточно прав для записи запроса в состоянии «Обработан»'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Создает и сохраняет справку в присоединенном файле.
Процедура СоздатьСправку()
	
	Результат = Документы.ЗапросСправкиСотрудником.ПечатнаяФормаСправки(ЭтотОбъект);

	Если Не Результат.ОК Тогда
		Возврат;
	КонецЕсли;
	
	ПечатнаяФормаСправки = Результат.ТабличныйДокумент;
	
	Если ПечатнаяФормаСправки.ВысотаТаблицы = 0 Тогда
		Справка = Справочники.ЗапросСправкиСотрудникомПрисоединенныеФайлы.ПустаяСсылка();
	Иначе
		Если ЗначениеЗаполнено(Ссылка) Тогда
			ВладелецФайлов = Ссылка;
		Иначе
			ВладелецФайлов = Документы.ЗапросСправкиСотрудником.ПолучитьСсылку();
			УстановитьСсылкуНового(ВладелецФайлов);
		КонецЕсли;
		
		СамообслуживаниеСотрудников.СохранитьТабличныйДокументВПрисоединенномФайле(ЭтотОбъект, ВладелецФайлов,
			ПечатнаяФормаСправки, "Справка", НСтр("ru = 'Справка'"), КадровыйЭДОВызовСервера.ТипФайлаЭлектронногоДокумента());
	КонецЕсли;
	
КонецПроцедуры

Функция ТребуетсяСформироватьСправкуАвтоматически(РежимЗаписи)
	
	Возврат РежимЗаписи = РежимЗаписиДокумента.Проведение И Не СправкаСформирована()
		И СамообслуживаниеСотрудников.ФормироватьСправкуАвтоматически(ВидСправки);
	
КонецФункции

Функция СправкаСформирована()
	
	Возврат ЗначениеЗаполнено(Справка) И Не ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Справка, "ПометкаУдаления");
		
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
